FemDesign.Sections.ComplexSectionPart
Reference type section used in entity definition. References to database section.
strusoft.xsd: complex_section_type (child of)

FemDesign.Sections.ComplexSectionPart.#ctor
Parameterless constructor for serialization.

FemDesign.Sections.ComplexSectionPart.#ctor(System.Double,FemDesign.Sections.Section,FemDesign.Bars.Eccentricity)
Constructor to create a ModelSection.
pos: Position parameter (0-1).
section: Cross-section at pos.
eccentricity: Eccentricity at pos.